run/tutorials/JetFlameH2/unsteady-openfoam4/01-ED-1step/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
"rho.*"
    {
        solver              PCG;
        preconditioner      DIC;
        tolerance           1e-7;
        relTol              0;
    };

    p
    {
        solver                GAMG;
        tolerance             1e-7;
        relTol                0.01;
        smoother              GaussSeidel;
        cacheAgglomeration    true;
        nCellsInCoarsestLevel 20;
        agglomerator          faceAreaPair;
        mergeLevels           1;
    };

    pFinal
    {
        solver                GAMG;
        tolerance             1e-6;
        relTol                0;
        smoother              GaussSeidel;
        cacheAgglomeration    true;
        nCellsInCoarsestLevel 20;
        agglomerator          faceAreaPair;
        mergeLevels           1;
    };

    U
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
        nSweeps         1;
    }

    UFinal
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-9;
        relTol          0;
        nSweeps         1;
    }


    "(h|k|epsilon)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.01;
        nSweeps         1;
    }

    "(h|k|epsilon)Final"
    {
        $h;
    }

    Yi
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0;
	minIter		1;
    }

    G
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-04;
        relTol          0;
    }

    GFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-04;
        relTol          0;
    } 
}

PIMPLE
{

    momentumPredictor 		yes;
    nOuterCorrectors  		1;
    nCorrectors       		2;
    nNonOrthogonalCorrectors 	0;
    consistent			yes;

    rhoMin          rhoMin [ 1 -3 0 0 0 ] 0.001;
    rhoMax          rhoMax [ 1 -3 0 0 0 ] 2.00;
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        default	1;
    }
}


// ************************************************************************* //
